help_website/app/controllers/users_controller.rb

      def destroy
        User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 82]]