help_website/app/controllers/users_controller.rb

INSERT INTO "users" ("firstName", "lastName", "email", "phone", "region", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["firstName", "sara"], ["lastName", ""], ["email", ""], ["phone", ""], ["region", ""], ["created_at", "2020-04-05 08:49:39.586002"], ["updated_at", "2020-04-05 08:49:39.586002"]]
---
      def create

        @user = User.new(user_params)

        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "moh@gmail.com"], ["updated_at", "2020-04-05 11:53:48.336231"], ["id", 25]]
---
      def update
        user = User.find(params[:id])
        user.update(user_params)